Repository: e-Deniska/easyMoney
Catalog: easyMoneyManager/easyMoney.Manager/Forms/SettingsForm.*.resx
Languages: ru

# lblInterfaceLanguage.Text
source: Interface language:
ru: Язык интерфейса:

# rbLanguageSystemDefault.Text
source: System default language
ru: Язык системы по умолчанию

# rbLanguageEnglish.Text
source: English
ru: English (английский)

# rbLanguageRussian.Text
source: Русский (russian)
ru: Русский

# cbShowFilenameInTitle.Text
source: Show database filename in title
ru: Показывать имя файла базы данных в заголовке

# lblUISettingAppliedAfterRestart.Text
source: These settings are applied after application restart.
ru: Эти настройки применяются после перезапуска.

# gbUISettings.Text
source: User interface
ru: Пользовательский интерфейс

# btnMetadata.Text
source: Open metadata manager
ru: Редактор метаданных

# lblMetadataDescription.Text
source: easyMoney could be easily extended using metadata. You can: - add your own currencies, change exchange rates; - add account types; - add transaction types; - add templates which you can use. WARNING! Using metadata manager requires understanding of metadata concepts. If you're not sure what are the changes, don't change it. You can't delete system metadata, however, there is a risk of loosing your transactions, based on custom metadata.
ru: easyMoney легко расширять, используя метаданные. Вы можете: - добавлять валюты, менять курсы обмена; - добавлять типы счетов; - добавлять типы транзакций; - добавлять шаблоны, доступные для использования. ВНИМАНИЕ! Использование метаданных требует глубокого понимания концепции метаданных. Не следует менять метаданные без полного понимания. Удалить системные метаданные невозможно, но есть риск потери всей информации, основанной на пользовательских метаданных.

# btnClearCustomMetadata.Text
source: Clear custom metadata
ru: Очистить метаданные

# gbCustomMetadata.Text
source: Custom metadata
ru: Настраиваемые метаданные

# cbShowOpenDialogEachStart.Text
source: Show open file dialog each application start
ru: Выбирать файл данных при запуске приложения

# lblPortabilityInfo.Text
source: WARNING! You should keep your financial data safe. It is better to encrypt file with a password, if you store it on a flash drive. However, if you forget password for the file, it is impossible to restore it. There are no backdoors or workarounds.
ru: ВНИМАНИЕ! Вы должны бережно хранить свои персональные данные. Шифруйте файл паролем, если он хранится на переносном диске. Однако, не забывайте пароль от файла. Пароль невозможно восстановить или как-либо обойти.

# lblKeepArchivesDays.Text
source: Duration to keep backups (in days)
ru: Период хранения резервных копий (в днях)

# gbFileSettings.Text
source: Data storage
ru: Хранение данных

# lblConnectivitySettingsAppliedAfterRestart.Text
source: These settings are applied after application restart.
ru: Эти настройки применяются после перезапуска.

# cbAllowAutoUpdate.Text
source: Automatically check for updates of easyMoney
ru: Автоматически проверять наличие обновлений

# gbConnectivity.Text
source: Connectivity
ru: Связь

# $this.Text
source: Settings
ru: Настройки
